<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/title.png' width=500/></center>

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/practice.png' width=300/></center>

# 실습 목표

- 데이터를 집계할 수 있습니다.
- 데이터프레임을 연결할 수 있습니다.
- 데이터프레임을 조인할 수 있습니다.
- Rolling, Shift 기능을 활용할 수 있습니다.

# P6. [실습] 데이터프레임 변경(3)

## [실습1] 데이터프레임 연결

In [1]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%config InlineBackend.figure_format='retina'

In [2]:
# graduate 데이터 불러오기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
graduate = pd.read_csv(file_path, sep = ',')

1) groupby() 메소드를 사용해 rank 별 gre, gpa 최댓값을 집계해서 df_max 데이터프레임을 만드세요.

- 단, as_index=False 옵션을 지정하세요.

In [3]:
# 집계
df_max = graduate.groupby('rank', as_index=False)[['gre','gpa']].max()

# 확인
df_max.head()

   rank  gre  gpa
0     1  800  4.0
1     2  800  4.0
2     3  800  4.0
3     4  800  4.0

2) rename() 메소드를 사용해 df_max 데이터프레임의 gre, gpa 열 이름을 각각 gre_max, gpa_max로 변경하세요.

In [4]:
# 열 이름 변경
df_max.rename(columns={'gre':'gre_max', 'gpa':'gpa_max'}, inplace=True)

# 확인
df_max.head()

   rank  gre_max  gpa_max
0     1      800      4.0
1     2      800      4.0
2     3      800      4.0
3     4      800      4.0

3) rank 별 gre, gpa 최솟값을 집계해서 df_min 데이터프레임을 만드세요.

- 단, as_index=False 옵션을 지정하세요.

In [5]:
# 집계
df_min = graduate.groupby('rank', as_index=False)[['gre','gpa']].min()

# 확인
df_min.head()

   rank  gre   gpa
0     1  340  2.42
1     2  300  2.42
2     3  220  2.56
3     4  300  2.26

4) df_min 데이터프레임의 gre, gpa 열 이름을 각각 gre_min, gpa_min로 변경하세요.

In [6]:
# 열 이름 변경
df_min.rename(columns = {'gre':'gre_min', 'gpa':'gpa_min'},inplace=True)

# 확인
df_min.head()

   rank  gre_min  gpa_min
0     1      340     2.42
1     2      300     2.42
2     3      220     2.56
3     4      300     2.26

5) concat() 함수를 사용해 df_max, df_min 데이터프레임을 연결한 결과를 갖는 df_graduate1 데이터프레임을 만드세요.

- 단, rank 열 중복을 없애기 위해 df_min 데이터프레임에서는 gre_min, gpa_min 열만 연결되게 하세요.

In [7]:
# 데이터프레임 연결
df_graduate1 = pd.concat([df_max, df_min[['gre_min', 'gpa_min']]], axis=1)

#확인
df_graduate1.head()

   rank  gre_max  gpa_max  gre_min  gpa_min
0     1      800      4.0      340     2.42
1     2      800      4.0      300     2.42
2     3      800      4.0      220     2.56
3     4      800      4.0      300     2.26

## [실습2] 데이터프레임 조인

In [8]:
# 라이브러리 불러오기
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

%config InlineBackend.figure_format='retina'

In [9]:
# graduate 데이터 불러오기
file_path = 'https://raw.githubusercontent.com/Jangrae/csv/master/Graduate_apply.csv'
graduate = pd.read_csv(file_path, sep = ',')

6) groupby() 메소드를 사용해 rank 별 gre, gpa 평균을 집계해서 df_mean 데이터프레임을 만드세요.

- 단, as_index=False 옵션을 지정하세요.

In [10]:
# 집계
df_mean = graduate.groupby('rank', as_index=False)[['gre','gpa']].mean()

# 확인
df_mean.head()

   rank         gre       gpa
0     1  611.803279  3.453115
1     2  596.026490  3.361656
2     3  574.876033  3.432893
3     4  570.149254  3.318358

7) rename() 메소드를 사용해 df_mean 데이터프레임의 gre, gpa 열 이름을 각각 gre_mean, gpa_mean로 변경하세요.

In [11]:
# 열 이름 변경
df_mean.rename(columns={'gre':'gre_mean', 'gpa':'gpa_mean'}, inplace=True)

# 확인
df_mean.head()

   rank    gre_mean  gpa_mean
0     1  611.803279  3.453115
1     2  596.026490  3.361656
2     3  574.876033  3.432893
3     4  570.149254  3.318358

8) rank 별 gre, gpa 합계를 집계해서 df_sum 데이터프레임을 만드세요.

- 단, as_index=False 옵션을 지정하세요.

In [12]:
# 집계
df_sum = graduate.groupby('rank', as_index=False)[['gre','gpa']].sum()

# 확인
df_sum.head()

   rank    gre     gpa
0     1  37320  210.64
1     2  90000  507.61
2     3  69560  415.38
3     4  38200  222.33

9) df_sum 데이터프레임의 gre, gpa 열 이름을 각각 gre_sum, gpa_sum로 변경하세요.

In [13]:
# 열 이름 변경
df_sum.rename(columns = {'gre':'gre_sum', 'gpa':'gpa_sum'},inplace=True)

# 확인
df_sum.head()

   rank  gre_sum  gpa_sum
0     1    37320   210.64
1     2    90000   507.61
2     3    69560   415.38
3     4    38200   222.33

10) merge() 함수를 사용해 df_mean, df_sum 데이터프레임을 조인한 결과를 갖는 df_graduate2 데이터프레임을 만드세요.

- 단, 양쪽 데이터프레임의 rank 열을 기준으로 inner join 하세요.

In [14]:
# 데이터프레임 조인
df_graduate2 = pd.merge(df_mean, df_sum, on='rank', how='inner')

# 확인
df_graduate2.head()

   rank    gre_mean  gpa_mean  gre_sum  gpa_sum
0     1  611.803279  3.453115    37320   210.64
1     2  596.026490  3.361656    90000   507.61
2     3  574.876033  3.432893    69560   415.38
3     4  570.149254  3.318358    38200   222.33

<center><img src='https://raw.githubusercontent.com/Jangrae/img/master/end.png' width=300/></center>